Revit 2027 API
ParameterTypeId.StructuralSectionCommonNominalWeight Property
 "Nominal Weight"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonNominalWeight { get; }
Public Shared ReadOnly Property StructuralSectionCommonNominalWeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonNominalWeight {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonNominalWeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace